MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA410/mcu.h
#define _T4CON_TIECS_POSITION                    0x00000008
#define _T4CON_TIECS_MASK                        0x00000300
#define _T4CON_TIECS_LENGTH                      0x00000002

#define _T4CON_TIECS0_POSITION                   0x00000008
#define _T4CON_TIECS0_MASK                       0x00000100
#define _T4CON_TIECS0_LENGTH                     0x00000001

#define _T4CON_TIECS1_POSITION                   0x00000009
#define _T4CON_TIECS1_MASK                       0x00000200
#define _T4CON_TIECS1_LENGTH                     0x00000001

#define _T4CON_T45_POSITION                      0x00000003
#define _T4CON_T45_MASK                          0x00000008
#define _T4CON_T45_LENGTH                        0x00000001

#define _T5CON_TCS_POSITION                      0x00000001
#define _T5CON_TCS_MASK                          0x00000002
#define _T5CON_TCS_LENGTH                        0x00000001

#define _T5CON_TCKPS_POSITION                    0x00000004
#define _T5CON_TCKPS_MASK                        0x00000030
#define _T5CON_TCKPS_LENGTH                      0x00000002

#define _T5CON_TGATE_POSITION                    0x00000006
#define _T5CON_TGATE_MASK                        0x00000040
#define _T5CON_TGATE_LENGTH                      0x00000001

#define _T5CON_TECS_POSITION                     0x00000008
#define _T5CON_TECS_MASK                         0x00000300
#define _T5CON_TECS_LENGTH                       0x00000002

#define _T5CON_TSIDL_POSITION                    0x0000000D
#define _T5CON_TSIDL_MASK                        0x00002000
#define _T5CON_TSIDL_LENGTH                      0x00000001

#define _T5CON_TON_POSITION                      0x0000000F
#define _T5CON_TON_MASK                          0x00008000
#define _T5CON_TON_LENGTH                        0x00000001

#define _T5CON_TCKPS0_POSITION                   0x00000004
#define _T5CON_TCKPS0_MASK                       0x00000010
#define _T5CON_TCKPS0_LENGTH                     0x00000001

#define _T5CON_TCKPS1_POSITION                   0x00000005
#define _T5CON_TCKPS1_MASK                       0x00000020
#define _T5CON_TCKPS1_LENGTH                     0x00000001

#define _T5CON_TECS0_POSITION                    0x00000008
#define _T5CON_TECS0_MASK                        0x00000100
#define _T5CON_TECS0_LENGTH                      0x00000001

#define _T5CON_TECS1_POSITION                    0x00000009
#define _T5CON_TECS1_MASK                        0x00000200
#define _T5CON_TECS1_LENGTH                      0x00000001

#define _T5CON_TIECS_POSITION                    0x00000008
#define _T5CON_TIECS_MASK                        0x00000300
#define _T5CON_TIECS_LENGTH                      0x00000002

#define _T5CON_TIECS0_POSITION                   0x00000008
#define _T5CON_TIECS0_MASK                       0x00000100
#define _T5CON_TIECS0_LENGTH                     0x00000001

#define _T5CON_TIECS1_POSITION                   0x00000009
#define _T5CON_TIECS1_MASK                       0x00000200
#define _T5CON_TIECS1_LENGTH                     0x00000001

#define _CTMUCON1L_IRNG_POSITION                 0x00000000
#define _CTMUCON1L_IRNG_MASK                     0x00000003
#define _CTMUCON1L_IRNG_LENGTH                   0x00000002

#define _CTMUCON1L_ITRIM_POSITION                0x00000002
#define _CTMUCON1L_ITRIM_MASK                    0x000000FC
#define _CTMUCON1L_ITRIM_LENGTH                  0x00000006

#define _CTMUCON1L_CTTRIG_POSITION               0x00000008
#define _CTMUCON1L_CTTRIG_MASK                   0x00000100
#define _CTMUCON1L_CTTRIG_LENGTH                 0x00000001

#define _CTMUCON1L_IDISSEN_POSITION              0x00000009
#define _CTMUCON1L_IDISSEN_MASK                  0x00000200
#define _CTMUCON1L_IDISSEN_LENGTH                0x00000001

#define _CTMUCON1L_EDGSEQEN_POSITION             0x0000000A
#define _CTMUCON1L_EDGSEQEN_MASK                 0x00000400
#define _CTMUCON1L_EDGSEQEN_LENGTH               0x00000001

#define _CTMUCON1L_EDGEN_POSITION                0x0000000B
#define _CTMUCON1L_EDGEN_MASK                    0x00000800
#define _CTMUCON1L_EDGEN_LENGTH                  0x00000001

#define _CTMUCON1L_TGEN_POSITION                 0x0000000C
#define _CTMUCON1L_TGEN_MASK                     0x00001000
#define _CTMUCON1L_TGEN_LENGTH                   0x00000001

#define _CTMUCON1L_CTMUSIDL_POSITION             0x0000000D
#define _CTMUCON1L_CTMUSIDL_MASK                 0x00002000
#define _CTMUCON1L_CTMUSIDL_LENGTH               0x00000001

#define _CTMUCON1L_CTMUEN_POSITION               0x0000000F
#define _CTMUCON1L_CTMUEN_MASK                   0x00008000
#define _CTMUCON1L_CTMUEN_LENGTH                 0x00000001

#define _CTMUCON1L_IRNG0_POSITION                0x00000000
#define _CTMUCON1L_IRNG0_MASK                    0x00000001
#define _CTMUCON1L_IRNG0_LENGTH                  0x00000001

#define _CTMUCON1L_IRNG1_POSITION                0x00000001
#define _CTMUCON1L_IRNG1_MASK                    0x00000002
#define _CTMUCON1L_IRNG1_LENGTH                  0x00000001

#define _CTMUCON1L_ITRIM0_POSITION               0x00000002
#define _CTMUCON1L_ITRIM0_MASK                   0x00000004
#define _CTMUCON1L_ITRIM0_LENGTH                 0x00000001

#define _CTMUCON1L_ITRIM1_POSITION               0x00000003
#define _CTMUCON1L_ITRIM1_MASK                   0x00000008
#define _CTMUCON1L_ITRIM1_LENGTH                 0x00000001

#define _CTMUCON1L_ITRIM2_POSITION               0x00000004
#define _CTMUCON1L_ITRIM2_MASK                   0x00000010
#define _CTMUCON1L_ITRIM2_LENGTH                 0x00000001

#define _CTMUCON1L_ITRIM3_POSITION               0x00000005
#define _CTMUCON1L_ITRIM3_MASK                   0x00000020
#define _CTMUCON1L_ITRIM3_LENGTH                 0x00000001

#define _CTMUCON1L_ITRIM4_POSITION               0x00000006
#define _CTMUCON1L_ITRIM4_MASK                   0x00000040
#define _CTMUCON1L_ITRIM4_LENGTH                 0x00000001

#define _CTMUCON1L_ITRIM5_POSITION               0x00000007
#define _CTMUCON1L_ITRIM5_MASK                   0x00000080
#define _CTMUCON1L_ITRIM5_LENGTH                 0x00000001

#define _CTMUCON1H_EDG2SEL_POSITION              0x00000002
#define _CTMUCON1H_EDG2SEL_MASK                  0x0000003C
#define _CTMUCON1H_EDG2SEL_LENGTH                0x00000004

#define _CTMUCON1H_EDG2POL_POSITION              0x00000006
#define _CTMUCON1H_EDG2POL_MASK                  0x00000040
#define _CTMUCON1H_EDG2POL_LENGTH                0x00000001

#define _CTMUCON1H_EDG2MOD_POSITION              0x00000007
#define _CTMUCON1H_EDG2MOD_MASK                  0x00000080
#define _CTMUCON1H_EDG2MOD_LENGTH                0x00000001

#define _CTMUCON1H_EDG1STAT_POSITION             0x00000008
#define _CTMUCON1H_EDG1STAT_MASK                 0x00000100
#define _CTMUCON1H_EDG1STAT_LENGTH               0x00000001

#define _CTMUCON1H_EDG2STAT_POSITION             0x00000009
#define _CTMUCON1H_EDG2STAT_MASK                 0x00000200
#define _CTMUCON1H_EDG2STAT_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL_POSITION              0x0000000A
#define _CTMUCON1H_EDG1SEL_MASK                  0x00003C00
#define _CTMUCON1H_EDG1SEL_LENGTH                0x00000004

