MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA410/mcu.h
#define _SPI4IMSK2_RXMSK5_POSITION               0x0000000D
#define _SPI4IMSK2_RXMSK5_MASK                   0x00002000
#define _SPI4IMSK2_RXMSK5_LENGTH                 0x00000001

#define _SPI4IMSKH_TXMSK_POSITION                0x00000000
#define _SPI4IMSKH_TXMSK_MASK                    0x0000003F
#define _SPI4IMSKH_TXMSK_LENGTH                  0x00000006

#define _SPI4IMSKH_TXWIEN_POSITION               0x00000007
#define _SPI4IMSKH_TXWIEN_MASK                   0x00000080
#define _SPI4IMSKH_TXWIEN_LENGTH                 0x00000001

#define _SPI4IMSKH_RXMSK_POSITION                0x00000008
#define _SPI4IMSKH_RXMSK_MASK                    0x00003F00
#define _SPI4IMSKH_RXMSK_LENGTH                  0x00000006

#define _SPI4IMSKH_RXWIEN_POSITION               0x0000000F
#define _SPI4IMSKH_RXWIEN_MASK                   0x00008000
#define _SPI4IMSKH_RXWIEN_LENGTH                 0x00000001

#define _SPI4IMSKH_TXMSK0_POSITION               0x00000000
#define _SPI4IMSKH_TXMSK0_MASK                   0x00000001
#define _SPI4IMSKH_TXMSK0_LENGTH                 0x00000001

#define _SPI4IMSKH_TXMSK1_POSITION               0x00000001
#define _SPI4IMSKH_TXMSK1_MASK                   0x00000002
#define _SPI4IMSKH_TXMSK1_LENGTH                 0x00000001

#define _SPI4IMSKH_TXMSK2_POSITION               0x00000002
#define _SPI4IMSKH_TXMSK2_MASK                   0x00000004
#define _SPI4IMSKH_TXMSK2_LENGTH                 0x00000001

#define _SPI4IMSKH_TXMSK3_POSITION               0x00000003
#define _SPI4IMSKH_TXMSK3_MASK                   0x00000008
#define _SPI4IMSKH_TXMSK3_LENGTH                 0x00000001

#define _SPI4IMSKH_TXMSK4_POSITION               0x00000004
#define _SPI4IMSKH_TXMSK4_MASK                   0x00000010
#define _SPI4IMSKH_TXMSK4_LENGTH                 0x00000001

#define _SPI4IMSKH_TXMSK5_POSITION               0x00000005
#define _SPI4IMSKH_TXMSK5_MASK                   0x00000020
#define _SPI4IMSKH_TXMSK5_LENGTH                 0x00000001

#define _SPI4IMSKH_RXMSK0_POSITION               0x00000008
#define _SPI4IMSKH_RXMSK0_MASK                   0x00000100
#define _SPI4IMSKH_RXMSK0_LENGTH                 0x00000001

#define _SPI4IMSKH_RXMSK1_POSITION               0x00000009
#define _SPI4IMSKH_RXMSK1_MASK                   0x00000200
#define _SPI4IMSKH_RXMSK1_LENGTH                 0x00000001

#define _SPI4IMSKH_RXMSK2_POSITION               0x0000000A
#define _SPI4IMSKH_RXMSK2_MASK                   0x00000400
#define _SPI4IMSKH_RXMSK2_LENGTH                 0x00000001

#define _SPI4IMSKH_RXMSK3_POSITION               0x0000000B
#define _SPI4IMSKH_RXMSK3_MASK                   0x00000800
#define _SPI4IMSKH_RXMSK3_LENGTH                 0x00000001

#define _SPI4IMSKH_RXMSK4_POSITION               0x0000000C
#define _SPI4IMSKH_RXMSK4_MASK                   0x00001000
#define _SPI4IMSKH_RXMSK4_LENGTH                 0x00000001

#define _SPI4IMSKH_RXMSK5_POSITION               0x0000000D
#define _SPI4IMSKH_RXMSK5_MASK                   0x00002000
#define _SPI4IMSKH_RXMSK5_LENGTH                 0x00000001

#define _SPI4URDTL_SPI4URDTL_POSITION            0x00000000
#define _SPI4URDTL_SPI4URDTL_MASK                0x0000FFFF
#define _SPI4URDTL_SPI4URDTL_LENGTH              0x00000010

#define _SPI4URDTL_URDATA_POSITION               0x00000000
#define _SPI4URDTL_URDATA_MASK                   0x0000FFFF
#define _SPI4URDTL_URDATA_LENGTH                 0x00000010

#define _SPI4URDTH_SPI4URDTH_POSITION            0x00000000
#define _SPI4URDTH_SPI4URDTH_MASK                0x0000FFFF
#define _SPI4URDTH_SPI4URDTH_LENGTH              0x00000010

#define _SPI4URDTH_URDATA_POSITION               0x00000000
#define _SPI4URDTH_URDATA_MASK                   0x0000FFFF
#define _SPI4URDTH_URDATA_LENGTH                 0x00000010

#define _CLC1CONL_MODE_POSITION                  0x00000000
#define _CLC1CONL_MODE_MASK                      0x00000007
#define _CLC1CONL_MODE_LENGTH                    0x00000003

#define _CLC1CONL_LCPOL_POSITION                 0x00000005
#define _CLC1CONL_LCPOL_MASK                     0x00000020
#define _CLC1CONL_LCPOL_LENGTH                   0x00000001

#define _CLC1CONL_LCOUT_POSITION                 0x00000006
#define _CLC1CONL_LCOUT_MASK                     0x00000040
#define _CLC1CONL_LCOUT_LENGTH                   0x00000001

#define _CLC1CONL_LCOE_POSITION                  0x00000007
#define _CLC1CONL_LCOE_MASK                      0x00000080
#define _CLC1CONL_LCOE_LENGTH                    0x00000001

#define _CLC1CONL_INTN_POSITION                  0x0000000A
#define _CLC1CONL_INTN_MASK                      0x00000400
#define _CLC1CONL_INTN_LENGTH                    0x00000001

#define _CLC1CONL_INTP_POSITION                  0x0000000B
#define _CLC1CONL_INTP_MASK                      0x00000800
#define _CLC1CONL_INTP_LENGTH                    0x00000001

#define _CLC1CONL_LCEN_POSITION                  0x0000000F
#define _CLC1CONL_LCEN_MASK                      0x00008000
#define _CLC1CONL_LCEN_LENGTH                    0x00000001

#define _CLC1CONL_MODE0_POSITION                 0x00000000
#define _CLC1CONL_MODE0_MASK                     0x00000001
#define _CLC1CONL_MODE0_LENGTH                   0x00000001

#define _CLC1CONL_MODE1_POSITION                 0x00000001
#define _CLC1CONL_MODE1_MASK                     0x00000002
#define _CLC1CONL_MODE1_LENGTH                   0x00000001

#define _CLC1CONL_MODE2_POSITION                 0x00000002
#define _CLC1CONL_MODE2_MASK                     0x00000004
#define _CLC1CONL_MODE2_LENGTH                   0x00000001

#define _CLC1CONH_G1POL_POSITION                 0x00000000
#define _CLC1CONH_G1POL_MASK                     0x00000001
#define _CLC1CONH_G1POL_LENGTH                   0x00000001

#define _CLC1CONH_G2POL_POSITION                 0x00000001
#define _CLC1CONH_G2POL_MASK                     0x00000002
#define _CLC1CONH_G2POL_LENGTH                   0x00000001

#define _CLC1CONH_G3POL_POSITION                 0x00000002
#define _CLC1CONH_G3POL_MASK                     0x00000004
#define _CLC1CONH_G3POL_LENGTH                   0x00000001

