MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA410/mcu.h
#define _LCDDATA7_S56C1_POSITION                 0x00000008
#define _LCDDATA7_S56C1_MASK                     0x00000100
#define _LCDDATA7_S56C1_LENGTH                   0x00000001

#define _LCDDATA7_S57C1_POSITION                 0x00000009
#define _LCDDATA7_S57C1_MASK                     0x00000200
#define _LCDDATA7_S57C1_LENGTH                   0x00000001

#define _LCDDATA7_S58C1_POSITION                 0x0000000A
#define _LCDDATA7_S58C1_MASK                     0x00000400
#define _LCDDATA7_S58C1_LENGTH                   0x00000001

#define _LCDDATA7_S59C1_POSITION                 0x0000000B
#define _LCDDATA7_S59C1_MASK                     0x00000800
#define _LCDDATA7_S59C1_LENGTH                   0x00000001

#define _LCDDATA7_S60C1_POSITION                 0x0000000C
#define _LCDDATA7_S60C1_MASK                     0x00001000
#define _LCDDATA7_S60C1_LENGTH                   0x00000001

#define _LCDDATA7_S61C1_POSITION                 0x0000000D
#define _LCDDATA7_S61C1_MASK                     0x00002000
#define _LCDDATA7_S61C1_LENGTH                   0x00000001

#define _LCDDATA7_S62C1_POSITION                 0x0000000E
#define _LCDDATA7_S62C1_MASK                     0x00004000
#define _LCDDATA7_S62C1_LENGTH                   0x00000001

#define _LCDDATA7_S63C1_POSITION                 0x0000000F
#define _LCDDATA7_S63C1_MASK                     0x00008000
#define _LCDDATA7_S63C1_LENGTH                   0x00000001

#define _LCDDATA8_S00C2_POSITION                 0x00000000
#define _LCDDATA8_S00C2_MASK                     0x00000001
#define _LCDDATA8_S00C2_LENGTH                   0x00000001

#define _LCDDATA8_S01C2_POSITION                 0x00000001
#define _LCDDATA8_S01C2_MASK                     0x00000002
#define _LCDDATA8_S01C2_LENGTH                   0x00000001

#define _LCDDATA8_S02C2_POSITION                 0x00000002
#define _LCDDATA8_S02C2_MASK                     0x00000004
#define _LCDDATA8_S02C2_LENGTH                   0x00000001

#define _LCDDATA8_S03C2_POSITION                 0x00000003
#define _LCDDATA8_S03C2_MASK                     0x00000008
#define _LCDDATA8_S03C2_LENGTH                   0x00000001

#define _LCDDATA8_S04C2_POSITION                 0x00000004
#define _LCDDATA8_S04C2_MASK                     0x00000010
#define _LCDDATA8_S04C2_LENGTH                   0x00000001

#define _LCDDATA8_S05C2_POSITION                 0x00000005
#define _LCDDATA8_S05C2_MASK                     0x00000020
#define _LCDDATA8_S05C2_LENGTH                   0x00000001

#define _LCDDATA8_S06C2_POSITION                 0x00000006
#define _LCDDATA8_S06C2_MASK                     0x00000040
#define _LCDDATA8_S06C2_LENGTH                   0x00000001

#define _LCDDATA8_S07C2_POSITION                 0x00000007
#define _LCDDATA8_S07C2_MASK                     0x00000080
#define _LCDDATA8_S07C2_LENGTH                   0x00000001

#define _LCDDATA8_S08C2_POSITION                 0x00000008
#define _LCDDATA8_S08C2_MASK                     0x00000100
#define _LCDDATA8_S08C2_LENGTH                   0x00000001

#define _LCDDATA8_S09C2_POSITION                 0x00000009
#define _LCDDATA8_S09C2_MASK                     0x00000200
#define _LCDDATA8_S09C2_LENGTH                   0x00000001

#define _LCDDATA8_S10C2_POSITION                 0x0000000A
#define _LCDDATA8_S10C2_MASK                     0x00000400
#define _LCDDATA8_S10C2_LENGTH                   0x00000001

#define _LCDDATA8_S11C2_POSITION                 0x0000000B
#define _LCDDATA8_S11C2_MASK                     0x00000800
#define _LCDDATA8_S11C2_LENGTH                   0x00000001

#define _LCDDATA8_S12C2_POSITION                 0x0000000C
#define _LCDDATA8_S12C2_MASK                     0x00001000
#define _LCDDATA8_S12C2_LENGTH                   0x00000001

#define _LCDDATA8_S13C2_POSITION                 0x0000000D
#define _LCDDATA8_S13C2_MASK                     0x00002000
#define _LCDDATA8_S13C2_LENGTH                   0x00000001

#define _LCDDATA8_S14C2_POSITION                 0x0000000E
#define _LCDDATA8_S14C2_MASK                     0x00004000
#define _LCDDATA8_S14C2_LENGTH                   0x00000001

#define _LCDDATA8_S15C2_POSITION                 0x0000000F
#define _LCDDATA8_S15C2_MASK                     0x00008000
#define _LCDDATA8_S15C2_LENGTH                   0x00000001

#define _LCDDATA9_S16C2_POSITION                 0x00000000
#define _LCDDATA9_S16C2_MASK                     0x00000001
#define _LCDDATA9_S16C2_LENGTH                   0x00000001

#define _LCDDATA9_S17C2_POSITION                 0x00000001
#define _LCDDATA9_S17C2_MASK                     0x00000002
#define _LCDDATA9_S17C2_LENGTH                   0x00000001

#define _LCDDATA9_S18C2_POSITION                 0x00000002
#define _LCDDATA9_S18C2_MASK                     0x00000004
#define _LCDDATA9_S18C2_LENGTH                   0x00000001

#define _LCDDATA9_S19C2_POSITION                 0x00000003
#define _LCDDATA9_S19C2_MASK                     0x00000008
#define _LCDDATA9_S19C2_LENGTH                   0x00000001

#define _LCDDATA9_S20C2_POSITION                 0x00000004
#define _LCDDATA9_S20C2_MASK                     0x00000010
#define _LCDDATA9_S20C2_LENGTH                   0x00000001

#define _LCDDATA9_S21C2_POSITION                 0x00000005
#define _LCDDATA9_S21C2_MASK                     0x00000020
#define _LCDDATA9_S21C2_LENGTH                   0x00000001

#define _LCDDATA9_S22C2_POSITION                 0x00000006
#define _LCDDATA9_S22C2_MASK                     0x00000040
#define _LCDDATA9_S22C2_LENGTH                   0x00000001

#define _LCDDATA9_S23C2_POSITION                 0x00000007
#define _LCDDATA9_S23C2_MASK                     0x00000080
#define _LCDDATA9_S23C2_LENGTH                   0x00000001

#define _LCDDATA9_S24C2_POSITION                 0x00000008
#define _LCDDATA9_S24C2_MASK                     0x00000100
#define _LCDDATA9_S24C2_LENGTH                   0x00000001

#define _LCDDATA9_S25C2_POSITION                 0x00000009
#define _LCDDATA9_S25C2_MASK                     0x00000200
#define _LCDDATA9_S25C2_LENGTH                   0x00000001

#define _LCDDATA9_S26C2_POSITION                 0x0000000A
#define _LCDDATA9_S26C2_MASK                     0x00000400
#define _LCDDATA9_S26C2_LENGTH                   0x00000001

