MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA410/mcu.h
#define _LCDDATA14_S40C3_POSITION                0x00000008
#define _LCDDATA14_S40C3_MASK                    0x00000100
#define _LCDDATA14_S40C3_LENGTH                  0x00000001

#define _LCDDATA14_S41C3_POSITION                0x00000009
#define _LCDDATA14_S41C3_MASK                    0x00000200
#define _LCDDATA14_S41C3_LENGTH                  0x00000001

#define _LCDDATA14_S42C3_POSITION                0x0000000A
#define _LCDDATA14_S42C3_MASK                    0x00000400
#define _LCDDATA14_S42C3_LENGTH                  0x00000001

#define _LCDDATA14_S43C3_POSITION                0x0000000B
#define _LCDDATA14_S43C3_MASK                    0x00000800
#define _LCDDATA14_S43C3_LENGTH                  0x00000001

#define _LCDDATA14_S44C3_POSITION                0x0000000C
#define _LCDDATA14_S44C3_MASK                    0x00001000
#define _LCDDATA14_S44C3_LENGTH                  0x00000001

#define _LCDDATA14_S45C3_POSITION                0x0000000D
#define _LCDDATA14_S45C3_MASK                    0x00002000
#define _LCDDATA14_S45C3_LENGTH                  0x00000001

#define _LCDDATA14_S46C3_POSITION                0x0000000E
#define _LCDDATA14_S46C3_MASK                    0x00004000
#define _LCDDATA14_S46C3_LENGTH                  0x00000001

#define _LCDDATA14_S47C3_POSITION                0x0000000F
#define _LCDDATA14_S47C3_MASK                    0x00008000
#define _LCDDATA14_S47C3_LENGTH                  0x00000001

#define _LCDDATA15_S48C3_POSITION                0x00000000
#define _LCDDATA15_S48C3_MASK                    0x00000001
#define _LCDDATA15_S48C3_LENGTH                  0x00000001

#define _LCDDATA15_S49C3_POSITION                0x00000001
#define _LCDDATA15_S49C3_MASK                    0x00000002
#define _LCDDATA15_S49C3_LENGTH                  0x00000001

#define _LCDDATA15_S50C3_POSITION                0x00000002
#define _LCDDATA15_S50C3_MASK                    0x00000004
#define _LCDDATA15_S50C3_LENGTH                  0x00000001

#define _LCDDATA15_S51C3_POSITION                0x00000003
#define _LCDDATA15_S51C3_MASK                    0x00000008
#define _LCDDATA15_S51C3_LENGTH                  0x00000001

#define _LCDDATA15_S52C3_POSITION                0x00000004
#define _LCDDATA15_S52C3_MASK                    0x00000010
#define _LCDDATA15_S52C3_LENGTH                  0x00000001

#define _LCDDATA15_S53C3_POSITION                0x00000005
#define _LCDDATA15_S53C3_MASK                    0x00000020
#define _LCDDATA15_S53C3_LENGTH                  0x00000001

#define _LCDDATA15_S54C3_POSITION                0x00000006
#define _LCDDATA15_S54C3_MASK                    0x00000040
#define _LCDDATA15_S54C3_LENGTH                  0x00000001

#define _LCDDATA15_S55C3_POSITION                0x00000007
#define _LCDDATA15_S55C3_MASK                    0x00000080
#define _LCDDATA15_S55C3_LENGTH                  0x00000001

#define _LCDDATA15_S56C3_POSITION                0x00000008
#define _LCDDATA15_S56C3_MASK                    0x00000100
#define _LCDDATA15_S56C3_LENGTH                  0x00000001

#define _LCDDATA15_S57C3_POSITION                0x00000009
#define _LCDDATA15_S57C3_MASK                    0x00000200
#define _LCDDATA15_S57C3_LENGTH                  0x00000001

#define _LCDDATA15_S58C3_POSITION                0x0000000A
#define _LCDDATA15_S58C3_MASK                    0x00000400
#define _LCDDATA15_S58C3_LENGTH                  0x00000001

#define _LCDDATA15_S59C3_POSITION                0x0000000B
#define _LCDDATA15_S59C3_MASK                    0x00000800
#define _LCDDATA15_S59C3_LENGTH                  0x00000001

#define _LCDDATA15_S60C3_POSITION                0x0000000C
#define _LCDDATA15_S60C3_MASK                    0x00001000
#define _LCDDATA15_S60C3_LENGTH                  0x00000001

#define _LCDDATA15_S61C3_POSITION                0x0000000D
#define _LCDDATA15_S61C3_MASK                    0x00002000
#define _LCDDATA15_S61C3_LENGTH                  0x00000001

#define _LCDDATA15_S62C3_POSITION                0x0000000E
#define _LCDDATA15_S62C3_MASK                    0x00004000
#define _LCDDATA15_S62C3_LENGTH                  0x00000001

#define _LCDDATA15_S63C3_POSITION                0x0000000F
#define _LCDDATA15_S63C3_MASK                    0x00008000
#define _LCDDATA15_S63C3_LENGTH                  0x00000001

#define _LCDDATA16_S00C4_POSITION                0x00000000
#define _LCDDATA16_S00C4_MASK                    0x00000001
#define _LCDDATA16_S00C4_LENGTH                  0x00000001

#define _LCDDATA16_S01C4_POSITION                0x00000001
#define _LCDDATA16_S01C4_MASK                    0x00000002
#define _LCDDATA16_S01C4_LENGTH                  0x00000001

#define _LCDDATA16_S02C4_POSITION                0x00000002
#define _LCDDATA16_S02C4_MASK                    0x00000004
#define _LCDDATA16_S02C4_LENGTH                  0x00000001

#define _LCDDATA16_S03C4_POSITION                0x00000003
#define _LCDDATA16_S03C4_MASK                    0x00000008
#define _LCDDATA16_S03C4_LENGTH                  0x00000001

#define _LCDDATA16_S04C4_POSITION                0x00000004
#define _LCDDATA16_S04C4_MASK                    0x00000010
#define _LCDDATA16_S04C4_LENGTH                  0x00000001

#define _LCDDATA16_S05C4_POSITION                0x00000005
#define _LCDDATA16_S05C4_MASK                    0x00000020
#define _LCDDATA16_S05C4_LENGTH                  0x00000001

#define _LCDDATA16_S06C4_POSITION                0x00000006
#define _LCDDATA16_S06C4_MASK                    0x00000040
#define _LCDDATA16_S06C4_LENGTH                  0x00000001

#define _LCDDATA16_S07C4_POSITION                0x00000007
#define _LCDDATA16_S07C4_MASK                    0x00000080
#define _LCDDATA16_S07C4_LENGTH                  0x00000001

#define _LCDDATA16_S08C4_POSITION                0x00000008
#define _LCDDATA16_S08C4_MASK                    0x00000100
#define _LCDDATA16_S08C4_LENGTH                  0x00000001

#define _LCDDATA16_S09C4_POSITION                0x00000009
#define _LCDDATA16_S09C4_MASK                    0x00000200
#define _LCDDATA16_S09C4_LENGTH                  0x00000001

