MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA410/mcu.h
#define _ANSH_ANSELH2_POSITION                   0x00000002
#define _ANSH_ANSELH2_MASK                       0x00000004
#define _ANSH_ANSELH2_LENGTH                     0x00000001

#define _ANSH_ANSELH3_POSITION                   0x00000003
#define _ANSH_ANSELH3_MASK                       0x00000008
#define _ANSH_ANSELH3_LENGTH                     0x00000001

#define _ANSH_ANSELH4_POSITION                   0x00000004
#define _ANSH_ANSELH4_MASK                       0x00000010
#define _ANSH_ANSELH4_LENGTH                     0x00000001

#define _IOCPH_IOCPH0_POSITION                   0x00000000
#define _IOCPH_IOCPH0_MASK                       0x00000001
#define _IOCPH_IOCPH0_LENGTH                     0x00000001

#define _IOCPH_IOCPH1_POSITION                   0x00000001
#define _IOCPH_IOCPH1_MASK                       0x00000002
#define _IOCPH_IOCPH1_LENGTH                     0x00000001

#define _IOCPH_IOCPH2_POSITION                   0x00000002
#define _IOCPH_IOCPH2_MASK                       0x00000004
#define _IOCPH_IOCPH2_LENGTH                     0x00000001

#define _IOCPH_IOCPH3_POSITION                   0x00000003
#define _IOCPH_IOCPH3_MASK                       0x00000008
#define _IOCPH_IOCPH3_LENGTH                     0x00000001

#define _IOCPH_IOCPH4_POSITION                   0x00000004
#define _IOCPH_IOCPH4_MASK                       0x00000010
#define _IOCPH_IOCPH4_LENGTH                     0x00000001

#define _IOCPH_IOCPH5_POSITION                   0x00000005
#define _IOCPH_IOCPH5_MASK                       0x00000020
#define _IOCPH_IOCPH5_LENGTH                     0x00000001

#define _IOCPH_IOCPH6_POSITION                   0x00000006
#define _IOCPH_IOCPH6_MASK                       0x00000040
#define _IOCPH_IOCPH6_LENGTH                     0x00000001

#define _IOCPH_IOCPH7_POSITION                   0x00000007
#define _IOCPH_IOCPH7_MASK                       0x00000080
#define _IOCPH_IOCPH7_LENGTH                     0x00000001

#define _IOCPH_IOCPH8_POSITION                   0x00000008
#define _IOCPH_IOCPH8_MASK                       0x00000100
#define _IOCPH_IOCPH8_LENGTH                     0x00000001

#define _IOCPH_IOCPH9_POSITION                   0x00000009
#define _IOCPH_IOCPH9_MASK                       0x00000200
#define _IOCPH_IOCPH9_LENGTH                     0x00000001

#define _IOCPH_IOCPH10_POSITION                  0x0000000A
#define _IOCPH_IOCPH10_MASK                      0x00000400
#define _IOCPH_IOCPH10_LENGTH                    0x00000001

#define _IOCPH_IOCPH11_POSITION                  0x0000000B
#define _IOCPH_IOCPH11_MASK                      0x00000800
#define _IOCPH_IOCPH11_LENGTH                    0x00000001

#define _IOCPH_IOCPH12_POSITION                  0x0000000C
#define _IOCPH_IOCPH12_MASK                      0x00001000
#define _IOCPH_IOCPH12_LENGTH                    0x00000001

#define _IOCPH_IOCPH13_POSITION                  0x0000000D
#define _IOCPH_IOCPH13_MASK                      0x00002000
#define _IOCPH_IOCPH13_LENGTH                    0x00000001

#define _IOCPH_IOCPH14_POSITION                  0x0000000E
#define _IOCPH_IOCPH14_MASK                      0x00004000
#define _IOCPH_IOCPH14_LENGTH                    0x00000001

#define _IOCPH_IOCPH15_POSITION                  0x0000000F
#define _IOCPH_IOCPH15_MASK                      0x00008000
#define _IOCPH_IOCPH15_LENGTH                    0x00000001

#define _IOCNH_IOCNH0_POSITION                   0x00000000
#define _IOCNH_IOCNH0_MASK                       0x00000001
#define _IOCNH_IOCNH0_LENGTH                     0x00000001

#define _IOCNH_IOCNH1_POSITION                   0x00000001
#define _IOCNH_IOCNH1_MASK                       0x00000002
#define _IOCNH_IOCNH1_LENGTH                     0x00000001

#define _IOCNH_IOCNH2_POSITION                   0x00000002
#define _IOCNH_IOCNH2_MASK                       0x00000004
#define _IOCNH_IOCNH2_LENGTH                     0x00000001

#define _IOCNH_IOCNH3_POSITION                   0x00000003
#define _IOCNH_IOCNH3_MASK                       0x00000008
#define _IOCNH_IOCNH3_LENGTH                     0x00000001

#define _IOCNH_IOCNH4_POSITION                   0x00000004
#define _IOCNH_IOCNH4_MASK                       0x00000010
#define _IOCNH_IOCNH4_LENGTH                     0x00000001

#define _IOCNH_IOCNH5_POSITION                   0x00000005
#define _IOCNH_IOCNH5_MASK                       0x00000020
#define _IOCNH_IOCNH5_LENGTH                     0x00000001

#define _IOCNH_IOCNH6_POSITION                   0x00000006
#define _IOCNH_IOCNH6_MASK                       0x00000040
#define _IOCNH_IOCNH6_LENGTH                     0x00000001

#define _IOCNH_IOCNH7_POSITION                   0x00000007
#define _IOCNH_IOCNH7_MASK                       0x00000080
#define _IOCNH_IOCNH7_LENGTH                     0x00000001

#define _IOCNH_IOCNH8_POSITION                   0x00000008
#define _IOCNH_IOCNH8_MASK                       0x00000100
#define _IOCNH_IOCNH8_LENGTH                     0x00000001

#define _IOCNH_IOCNH9_POSITION                   0x00000009
#define _IOCNH_IOCNH9_MASK                       0x00000200
#define _IOCNH_IOCNH9_LENGTH                     0x00000001

#define _IOCNH_IOCNH10_POSITION                  0x0000000A
#define _IOCNH_IOCNH10_MASK                      0x00000400
#define _IOCNH_IOCNH10_LENGTH                    0x00000001

#define _IOCNH_IOCNH11_POSITION                  0x0000000B
#define _IOCNH_IOCNH11_MASK                      0x00000800
#define _IOCNH_IOCNH11_LENGTH                    0x00000001

#define _IOCNH_IOCNH12_POSITION                  0x0000000C
#define _IOCNH_IOCNH12_MASK                      0x00001000
#define _IOCNH_IOCNH12_LENGTH                    0x00000001

#define _IOCNH_IOCNH13_POSITION                  0x0000000D
#define _IOCNH_IOCNH13_MASK                      0x00002000
#define _IOCNH_IOCNH13_LENGTH                    0x00000001

#define _IOCNH_IOCNH14_POSITION                  0x0000000E
#define _IOCNH_IOCNH14_MASK                      0x00004000
#define _IOCNH_IOCNH14_LENGTH                    0x00000001

#define _IOCNH_IOCNH15_POSITION                  0x0000000F
#define _IOCNH_IOCNH15_MASK                      0x00008000
#define _IOCNH_IOCNH15_LENGTH                    0x00000001

