MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA410/mcu.h
#define DSSWEN_OFF           0x00FF
#define DSSWEN_ON            0x80FF

/* Register FDEVOPT1 (0x157b0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT1;
#define _FDEVOPT1(x) __attribute__((address(0x157b0),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT1.sec"),space(prog))) __prog__ uint16_t _FDEVOPT1 = (x);

/*
** Only one invocation of FDEVOPT1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT1.
** Multiple options may be combined, as shown:
**
** _FDEVOPT1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Alternate Comparator Input Enable bit:
**     ALTCMPI_ENABLE       C1INC, C2INC and C3INC are on RG9
**     ALTCMPI_DISABLE      C1INC, C2INC, and C3INC are on their standard pin locations
**
**   Tamper Pin Enable bit:
**     TMPRPIN_ON           TMPRN pin function is enabled
**     TMPRPIN_OFF          TMPRN pin function is disabled
**
**   RAM Based Entryption Key Wipe Enable bit:
**     TMPRWIPE_ON          Cryptographic Engine Key RAM is erased when a TMPR pin event is detected
**     TMPRWIPE_OFF         Cryptographic Engine Key RAM is not erased onTMPR pin events
**
**   Alternate VREF location Enable:
**     ALTVREF_ALTVREFEN    VREF is on an alternate pin (VREF+ on RB0 and VREF- on RB1)
**     ALTVREF_ALTVREFDIS   VREF is on a default pin (VREF+ on RA10 and VREF- on RA9)
**
*/

#define ALTCMPI_ENABLE       0x001C
#define ALTCMPI_DISABLE      0x001E

#define TMPRPIN_ON           0x001A
#define TMPRPIN_OFF          0x001E

#define TMPRWIPE_ON          0x0016
#define TMPRWIPE_OFF         0x001E

#define ALTVREF_ALTVREFEN    0x000E
#define ALTVREF_ALTVREFDIS   0x001E

/* Register FBTSEQ (0x157fc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBTSEQ;
#define _FBTSEQ(x) __attribute__((address(0x157fc),deprecated_definition("consider migrating to #pragma config"),section("__FBTSEQ.sec"),space(prog))) __prog__ uint16_t _FBTSEQ = (x);

/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after devie Reset; the partition containing a lower boot number will be active.:
**     BSEQ_BSEQ            Boot Sequence Number bits
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**     IBSEQ_IBSEQ          Inverse Boot Sequence Number bits
**
*/

#define BSEQ_BSEQ            0xF000

#define IBSEQ_IBSEQ          0xFF0FFF

#endif

/* Fuses that are only present in dual panel mode */

#ifdef __DUAL_PARTITION
/* Register FSEC (0xab80)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSEC;
#define _FSEC(x) __attribute__((address(0xab80),deprecated_definition("consider migrating to #pragma config"),section("__FSEC.sec"),space(prog))) __prog__ uint16_t _FSEC = (x);

/*
** Only one invocation of FSEC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSEC.
** Multiple options may be combined, as shown:
**
** _FSEC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write Protect:
**     BWRP_ON              Boot segment is write-protected
**     BWRP_OFF             Boot segment may be written
**
**   Boot segment Protect:
**     BSS_HI               High Security
**     BSS_STD              Standard Security
**     BSS_OFF              No Protection (other than BWRP)
**
**   Boot Segment Control bit:
**     BSEN_ON              Boot Segment size determined by FBSLIM
**     BSEN_OFF             No Boot Segment
**
**   General Segment Write Protect:
**     GWRP_ON              General segment is write-protected
**     GWRP_OFF             Writes to program memory are allowed
**
**   General Segment Code Protect:
**     GSS_HI               High Security
**     GSS_STD              Standard Security
**     GSS_OFF              Code protection is disabled
**
**   Configuration Segment Program Write Protection bit:
**     CWRP_ON              Configuration Segment is write protected
**     CWRP_OFF             Configuration Segment may be written
**
**   Configuration Segment Code Protection Level bits:
**     CSS_HI               High Security
**     CSS_ENH              Enhanced Security
**     CSS_STD              Standard Security
**     CSS_DIS              No Protection (other than CWRP)
**
**   Alternate Interrupt Vector Table Disable bit:
**     AIVTDIS_ENABLE       Enable AIVT
**     AIVTDIS_DISABLE      Disable AIVT
**
*/

#define BWRP_ON              0x8FEE
#define BWRP_OFF             0x8FEF

#define BSS_HI               0x8FE9
#define BSS_STD              0x8FED
#define BSS_OFF              0x8FEF

#define BSEN_ON              0x8FE7
#define BSEN_OFF             0x8FEF

#define GWRP_ON              0x8FCF
#define GWRP_OFF             0x8FEF

#define GSS_HI               0x8F2F
#define GSS_STD              0x8FAF
#define GSS_OFF              0x8FEF

#define CWRP_ON              0x8EEF
#define CWRP_OFF             0x8FEF

#define CSS_HI               0x81EF
#define CSS_ENH              0x89EF
#define CSS_STD              0x8DEF
#define CSS_DIS              0x8FEF

#define AIVTDIS_ENABLE       0x0FEF
#define AIVTDIS_DISABLE      0x8FEF

/* Register FBSLIM (0xab90)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBSLIM;
#define _FBSLIM(x) __attribute__((address(0xab90),deprecated_definition("consider migrating to #pragma config"),section("__FBSLIM.sec"),space(prog))) __prog__ uint16_t _FBSLIM = (x);

/*
** Only one invocation of FBSLIM should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBSLIM.
** Multiple options may be combined, as shown:
**
** _FBSLIM( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Code Flash Page Address Limit bits:
**     BSLIM_BSLIM          Boot Segment Flash page address limit
**
*/

#define BSLIM_BSLIM          0x0000

/* Register FSIGN (0xab94)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSIGN;
#define _FSIGN(x) __attribute__((address(0xab94),deprecated_definition("consider migrating to #pragma config"),section("__FSIGN.sec"),space(prog))) __prog__ uint16_t _FSIGN = (x);

